{
  "peft_type": "LORA",
  "task_type": "CAUSAL_LM",
  "inference_mode": false,
  "r": 16,
  "target_modules": [
    "q_proj",
    "k_proj",
    "v_proj",
    "o_proj",
    "gate_proj",
    "up_proj",
    "down_proj"
  ],
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "fan_in_fan_out": false,
  "bias": "none",
  "modules_to_save": null,
  "layers_to_transform": null,
  "layers_pattern": null,
  "rank_pattern": {},
  "alpha_pattern": {},
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "init_lora_weights": true,
  "layer_replication": null
}
